RMK/src/Documents/РозничнаяПродажа/РозничнаяПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="22333214-d2d7-41a3-beec-04ee5adb9ee9">
  <name>РозничнаяПродажа</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>EnumRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="076abc47-c844-4309-9eae-64879834b922">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="241812bd-abde-4d9a-9cce-ceb973d2fba7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba50d043-730b-4748-b671-d72c62ab28ea">
    <name>ИдентификаторУстройства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b7cdc59-2f60-428f-9f7e-c738a51fa10a">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9da04edc-7714-48ff-be74-fa552f6822c6">
    <name>ВидОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5f54f37-9772-4f74-bde8-6e2ebc97817a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="78fd6f6d-d6f0-48a7-a0d8-20f8699096ba">
    <name>НомерСменыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="081d0306-4f76-4104-832d-f3ccf7670529">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d68fdf7-687b-43fb-b4c3-b586678e3978">
    <name>БезналичныйРасчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9593258c-d29d-4dcb-bc60-8a416bc11a56">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="13883288-ecfc-4fae-95f3-5f105d4f1506">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="019011ee-0946-4c2f-be0b-01fb971f3c6a">
    <name>СуммаВключаетНалоги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99f5257c-f7b8-4f1f-af41-3d1ab169dd0a">
    <name>ОтчетОРозничныхПродажах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16ac66e9-4f0a-4cb1-be9f-6aa2120828c6">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5075147e-d2c0-4794-bcd9-bf17d22bf835">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c07c1690-a629-4f5c-8f64-f420bffc10ad">
    <name>ТочностьЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a75edfe4-cdae-427f-92ab-bfe70a72f0e6">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b6a926e-c1b3-4c43-b639-03489a299009">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаСкидок</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="0ae88504-3d7a-4b73-8387-94530ef48af7">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7d163890-c5ae-4a38-a5ae-bd7b0c4b9589">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="416f5884-9650-43c7-a6fe-efbcb1cd35a0">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="68111e70-e217-470b-93d6-ea685836b816">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>18</precision>
            <scale>5</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3545763b-574f-462d-8566-c47aa925ca7e">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ed1d04a1-c486-461e-90b2-6067700baea5">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6b094d3c-6227-4dd9-b0c1-797e4462fe9d">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="dfab0cb9-be6d-4e6a-89ed-a5acbc0fecee">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4a9e3ad-6a7d-4ea4-915d-9ddf5b0b2afc">
      <name>СтавкаНСП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c1f619b6-4d7f-446f-a7c6-31fd81317e1d">
      <name>СчетДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c6097e9-7d95-4047-be24-dc05066c7188">
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f8f74310-56ea-4236-9487-3489da29d432">
      <name>СуммаДохода</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1aea0604-e031-4140-a6e1-3b75235e1af7">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6beec762-694a-4e89-b023-986ca9043b02">
      <name>КодМаркировки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="021435d0-d63a-4de7-a9f4-89b67fe41475">
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="113520a0-d76d-4721-b9f4-362ba99f7671">
      <name>СуммаНСП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d673d9c6-0b24-4fba-90af-29edd15ecaee">
      <name>СчетСебестоимости</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d872513c-2c38-4367-8673-791b5f087c34">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаДоходаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДССкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНСПСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="acb6c5bd-a0e2-443f-beff-b6c1ae33d443">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a5fc2245-dd62-4cfe-a9e2-ef2f96301263">
      <name>СчетДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3e9370d9-ac53-4f9f-a0a4-ad79d6d822b1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d4d5d1c0-52a8-40fb-b6ac-548829d361ed">
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bcc1be89-7176-49b6-93be-9616ac0f96f9">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e0e67819-968e-4260-9a34-970a4e4b40a6">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f1fbd817-9173-4076-a825-002505c7bbaf">
      <name>СуммаДохода</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="35d794b5-dd73-45d7-a2d0-952835f2e2e7">
      <name>ДополнительныеСведения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6d84992b-431c-4d93-a845-d614f8bb9a30">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>18</precision>
            <scale>5</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="df071153-5712-435c-bce8-2fcb453f6219">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0feba590-38b5-45e3-9c17-db8e2de06b30">
      <name>СуммаНСП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="287cec8f-3064-43cf-a431-bd8ac2d4dc58">
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="30a8b0c7-480b-4a02-aa70-19fdb16afc0c">
      <name>СтавкаНСП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="685ccd5e-a99e-4108-9efe-d99ace1e2429">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="792a2e33-7587-4b29-a0af-82ceecb503ea">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

RMK/src/Documents/РозничнаяПродажа/ManagerModule.bsl
&Вместо("ПечатьТоварногоЧека")
Функция Рмк_ПечатьТоварногоЧека(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "РозничнаяПродажа_ТоварныйЧек";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РозничнаяПродажа.ПФ_MXL_ТоварныйЧек");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Номер КАК Номер,
		|	ТаблицаДокумента.Дата КАК Дата,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
		|	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ТаблицаДокумента.Склад КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Склад) КАК СкладПредставление,
		|	ТаблицаДокумента.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Товары.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП, 
		|		СуммаСкидки КАК СуммаСкидки,
		|		Всего КАК Всего
		|	) КАК Товары,
		|	ТаблицаДокумента.Услуги.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Услуги.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП, 
		|		Всего КАК Всего
		|	) КАК Услуги
		|ИЗ
		|	Документ.РозничнаяПродажа КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);

	Шапка = Запрос.Выполнить().Выбрать();
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;

		ТекстЗаголовка = СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Товарный чек'"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ОрганизацияПредставление", Шапка.ОрганизацияПредставление);
		ДанныеПечати.Вставить("СкладПредставление", Шапка.СкладПредставление);
		ДанныеПечати.Вставить("ПолучательПредставление", "Розничный покупатель");
		
		ТаблицаТовары = Шапка.Товары.Выгрузить();
		ТаблицаУслуги = Шапка.Услуги.Выгрузить();

		Всего = ТаблицаТовары.Итог("Всего") + ТаблицаУслуги.Итог("Всего");
		ВсегоНДС = ТаблицаТовары.Итог("СуммаНДС") + ТаблицаУслуги.Итог("СуммаНДС");
		ВсегоНСП = ТаблицаТовары.Итог("СуммаНСП") + ТаблицаУслуги.Итог("СуммаНСП");
		КоличествоНаименований = ТаблицаТовары.Количество() + ТаблицаУслуги.Количество();		
		
		ДанныеПечати.Вставить("Всего", Всего);
		ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДС);
		ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСП);
		ДанныеПечати.Вставить("ИтоговаяСтрока", 
			СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"), 
			Формат(КоличествоНаименований, "ЧН=0; ЧГ=0"), Формат(ДанныеПечати.Всего, "ЧЦ=15; ЧДЦ=2")));
		ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.Всего, Шапка.ВалютаДокумента));
		
		// Области
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("ШапкаТаблицы");
		МассивОбластейМакета.Добавить("Строка");
		МассивОбластейМакета.Добавить("Подвал");
		МассивОбластейМакета.Добавить("Итоги");
		МассивОбластейМакета.Добавить("ИтогиНДС");
		МассивОбластейМакета.Добавить("ИтогиНСП");
		МассивОбластейМакета.Добавить("СуммаПрописью");
		МассивОбластейМакета.Добавить("Подписи");
		
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти = "Строка" Тогда 
				Для Каждого СтрокаТаблицы Из ТаблицаТовары Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаУслуги Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
			Иначе 
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);	
			КонецЕсли;	
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;

	Возврат ТабличныйДокумент;


КонецФункции
